/*
 Navicat Premium Dump SQL

 Source Server         : MySQL
 Source Server Type    : MySQL
 Source Server Version : 80021 (8.0.21)
 Source Host           : localhost:3306
 Source Schema         : db_xiaoshuo

 Target Server Type    : MySQL
 Target Server Version : 80021 (8.0.21)
 File Encoding         : 65001

 Date: 12/12/2025 17:48:18
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for admin_user
-- ----------------------------
DROP TABLE IF EXISTS `admin_user`;
CREATE TABLE `admin_user`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `USERNAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户名',
  `PASSWORD` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `ROLE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '管理员' COMMENT '角色',
  `CREATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '新增时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 3 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '用户表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of admin_user
-- ----------------------------
INSERT INTO `admin_user` VALUES (1, 'java1234', '123456', '管理员', '2025-03-19 11:19:27');
INSERT INTO `admin_user` VALUES (2, 'admin', '{bcrypt}$2a$10$OedMXjibvKekhMaNf9eXu.Yf5tSIyiYpyI87HUxUS0OaKtzSWTu/C', '管理员', '2025-12-11 18:43:49');

-- ----------------------------
-- Table structure for announcement
-- ----------------------------
DROP TABLE IF EXISTS `announcement`;
CREATE TABLE `announcement`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `TITLE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '标题',
  `INTRODUCTION` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '简介',
  `PICTURE` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '图片',
  `CONTENT` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 69 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '公告信息' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of announcement
-- ----------------------------
INSERT INTO `announcement` VALUES (61, '2025-03-19 11:19:26', '有梦想，就要努力去实现', '不管你想要怎样的生活，你都要去努力争取，不多尝试一些事情怎么知道自己适合什么、不适合什么呢?你说你喜欢读书，让我给你列书单，你还问我哪里有那么多时间看书;你说自己梦想的职业是广告文案，问我如何成为一个文案，应该具备哪些素质;你说你计划晨跑，但总是因为学习、工作辛苦或者身体不舒服第二天起不了床;你说你一直梦想一个人去长途旅行，但是没钱，父母觉得危险。', 'upload/news_picture1.jpg', '<p>不管你想要怎样的生活，你都要去努力争取，不多尝试一些事情怎么知道自己适合什么、不适合什么呢?</p><p>你说你喜欢读书，让我给你列书单，你还问我哪里有那么多时间看书;你说自己梦想的职业是广告文案，问我如何成为一个文案，应该具备哪些素质;你说你计划晨跑，但总是因为学习、工作辛苦或者身体不舒服第二天起不了床;你说你一直梦想一个人去长途旅行，但是没钱，父母觉得危险。其实，我已经厌倦了你这样说说而已的把戏，我觉得就算我告诉你如何去做，你也不会照做，因为你根本什么都不做。</p><p>真正有行动力的人不需要别人告诉他如何做，因为他已经在做了。就算碰到问题，他也会自己想办法，自己动手去解决或者主动寻求可以帮助他的人，而不是等着别人为自己解决问题。</p><p>首先要学习独立思考。花一点时间想一下自己喜欢什么，梦想是什么，不要别人说想环游世界，你就说你的梦想是环游世界。</p><p>很多人说现实束缚了自己，其实在这个世界上，我们一直都可以有很多选择，生活的决定权也—直都在自己手上，只是我们缺乏行动力而已。</p><p>如果你觉得安于现状是你想要的，那选择安于现状就会让你幸福和满足;如果你不甘平庸，选择一条改变、进取和奋斗的道路，在这个追求的过程中，你也一样会感到快乐。所谓的成功，即是按照自己想要的生活方式生活。最糟糕的状态，莫过于当你想要选择一条不甘平庸、改变、进取和奋斗的道路时，却以一种安于现状的方式生活，最后抱怨自己没有得到想要的人生。</p><p>因为喜欢，你不是在苦苦坚持，也因为喜欢，你愿意投入时间、精力，长久以往，获得成功就是自然而然的事情。</p>');
INSERT INTO `announcement` VALUES (62, '2025-03-19 11:19:26', '又是一年毕业季', '又是一年毕业季，感慨万千，还记的自己刚进学校那时候的情景，我拖着沉重的行李箱站在偌大的教学楼前面，感叹自己未来的日子即将在这个陌生的校园里度过，而如今斗转星移，浮光掠影，弹指之间，那些青葱岁月如同白驹过隙般悄然从指缝溜走。过去的种种在胸口交集纠结，像打翻的五味瓶，甜蜜，酸楚，苦涩，一并涌上心头。', 'upload/news_picture2.jpg', '<p>又是一年毕业季，感慨万千，还记的自己刚进学校那时候的情景，我拖着沉重的行李箱站在偌大的教学楼前面，感叹自己未来的日子即将在这个陌生的校园里度过，而如今斗转星移，浮光掠影，弹指之间，那些青葱岁月如同白驹过隙般悄然从指缝溜走。</p><p>过去的种种在胸口交集纠结，像打翻的五味瓶，甜蜜，酸楚，苦涩，一并涌上心头。一直都是晚会的忠实参与者，无论是台前还是幕后，忽然间，角色转变，那种感觉确实难以用语言表达。</p><p>	过去的三年，总是默默地期盼着这个好雨时节，因为这时候，会有灿烂的阳光，会有满目的百花争艳，会有香甜的冰激凌，这是个毕业的季节，当时不经世事的我们会殷切地期待学校那一大堆的活动，期待穿上绚丽的演出服或者礼仪服，站在大礼堂镁光灯下尽情挥洒我们的澎拜的激情。</p><p>百感交集，隔岸观火与身临其境的感觉竟是如此不同。从来没想过一场晚会送走的是我们自己的时候会是怎样的感情，毕业就真的意味着结束吗?倔强的我们不愿意承认，谢谢学弟学妹们慷慨的将这次的主题定为“我们在这里”。我知道，这可能是他们对我们这些过来人的尊敬和施舍。</p><p>没有为这场晚会排练、奔波，没有为班级、学生会、文学院出点力，还真有点不习惯，百般无奈中，用“工作忙”个万能的借口来搪塞自己，欺骗别人。其实自己心里明白，那只是在逃避，只是不愿面对繁华落幕后的萧条和落寞。大四了，大家各奔东西，想凑齐班上的人真的是难上加难，敏燕从越南回来，刚落地就匆匆回了学校，那么恋家的人也启程回来了，睿睿学姐也是从家赶来跟我们团圆。大家—如既往的寒暄、打趣、调侃对方，似乎一切又回到了当初的单纯美好。</p><p>看着舞台上活泼可爱的学弟学妹们，如同一群机灵的小精灵，清澈的眼神，稚嫩的肢体，轻快地步伐，用他们那热情洋溢的舞姿渲染着在场的每一个人，我知道，我不应该羡慕嫉妒他们，不应该顾自怜惜逝去的青春，不应该感叹夕阳无限好，曾经，我们也拥有过，曾经，我们也年轻过，曾经，我们也灿烂过。我深深地告诉自己，人生的每个阶段都是美的，年轻有年轻的活力，成熟也有成熟的魅力。多—份稳重、淡然、优雅，也是漫漫时光掠影遗留下的.珍贵赏赐。</p>');
INSERT INTO `announcement` VALUES (63, '2025-03-19 11:19:26', '挫折路上，坚持常在心间', '回头看看，你会不会发现，曾经的你在这里摔倒过;回头看看，你是否发现，一次次地重复着，却从没爬起过。而如今，让我们把视线转向前方，那一道道金色的弧线，是流星飞逝的痕迹，或是成功运行的轨道。今天的你，是否要扬帆起航，让幸福来敲门?清晨的太阳撒向大地，神奇的宇宙赋予它神奇的色彩，大自然沐浴着春光，世界因太阳的照射而精彩，林中百鸟啾啾，河水轻轻流淌，汇成清宁的山间小调。', 'upload/news_picture3.jpg', '<p>回头看看，你会不会发现，曾经的你在这里摔倒过;回头看看，你是否发现，一次次地重复着，却从没爬起过。而如今，让我们把视线转向前方，那一道道金色的弧线，是流星飞逝的痕迹，或是成功运行的轨道。今天的你，是否要扬帆起航，让幸福来敲门?</p><p>清晨的太阳撒向大地，神奇的宇宙赋予它神奇的色彩，大自然沐浴着春光，世界因太阳的照射而精彩，林中百鸟啾啾，河水轻轻流淌，汇成清宁的山间小调。</p><p>是的，面对道途上那无情的嘲讽，面对步伐中那重复的摔跤，面对激流与硬石之间猛烈的碰撞，我们必须选择那富于阴雨，却最终见到彩虹的荆棘路。也许，经历了那暴风雨的洗礼，我们便会变得自信，幸福也随之而来。</p><p>司马迁屡遭羞辱，却依然在狱中撰写《史记》，作为一名史学家，不因王权而极度赞赏，也不因卑微而极度批判，然而他在坚持自己操守的同时，却依然要受统治阶级的阻碍，他似乎无权选择自己的本职。但是，他不顾于此，只是在面对道途的阻隔之时，他依然选择了走下去的信念。终于一部开山巨作《史记》诞生，为后人留下一份馈赠，也许在他完成毕生的杰作之时，他微微地笑了，没有什么比梦想实现更快乐的了......</p><p>	或许正如“长风破浪会有时，直挂云帆济沧海”一般，欣欣然地走向看似深渊的崎岖路，而在一番耕耘之后，便会发现这里另有一番天地。也许这就是困难与快乐的交融。</p><p>也许在形形色色的社会中，我们常能看到一份坚持，一份自信，但这里却还有一类人。这类人在暴风雨来临之际，只会闪躲，从未懂得这也是一种历炼，这何尝不是一份快乐。在阴暗的角落里，总是独自在哭，带着伤愁，看不到一点希望。</p><p>我们不能堕落于此，而要像海燕那般，在苍茫的大海上，高傲地飞翔，任何事物都无法阻挡，任何事都是幸福快乐的。</p>');
INSERT INTO `announcement` VALUES (64, '2025-03-19 11:19:26', '挫折是另一个生命的开端', '当遇到挫折或失败，你是看见失败还是看见机会?挫折是我们每个人成长的必经之路，它不是你想有就有，想没有就没有的。有句名言说的好，如果你想一生摆脱苦难，你就得是神或者是死尸。这句话形象地说明了挫折是伴随着人生的，是谁都逃不掉的。', 'upload/news_picture4.jpg', '<p>当遇到挫折或失败，你是看见失败还是看见机会?</p><p>挫折是我们每个人成长的必经之路，它不是你想有就有，想没有就没有的。有句名言说的好，如果你想一生摆脱苦难，你就得是神或者是死尸。这句话形象地说明了挫折是伴随着人生的，是谁都逃不掉的。</p><p>人生在世，从古到今，不分天子平民，机遇虽有不同，但总不免有身陷困境或遭遇难题之处，这时候唯有通权达变，才能使人转危为安，甚至反败为胜。</p><p>大部分的人，一生当中，最痛苦的经验是失去所爱的人，其次是丢掉一份工作。其实，经得起考验的人，就算是被开除也不会惊慌，要学会面对。</p><p>	“塞翁失马，焉知非福。”人生的道路，并不是每一步都迈向成功，这就是追求的意义。我们还要认识到一点，挫折作为一种情绪状态和一种个人体验，各人的耐受性是大不相同的，有的人经历了一次次挫折，就能够坚忍不拔，百折不挠;有的人稍遇挫折便意志消沉，一蹶不振。所以，挫折感是一种主观感受，因为人的目的和需要不同，成功标准不同，所以同一种活动对于不同的人可能会造成不同的挫折感受。</p><p>凡事皆以平常心来看待，对于生命顺逆不要太执著。能够“破我执”是很高层的人生境界。</p><p>人事的艰难就是一种考验。就像—支剑要有磨刀来磨，剑才会利:一块璞玉要有粗石来磨，才会发出耀眼的光芒。我们能够做到的，只是如何减少、避免那些由于自身的原因所造成的挫折，而在遇到痛苦和挫折之后，则力求化解痛苦，争取幸福。我们要知道，痛苦和挫折是双重性的，它既是我们人生中难以完全避免的，也是我们在争取成功时，不可缺少的一种动力。因为我认为，推动我们奋斗的力量，不仅仅是对成功的渴望，还有为摆脱痛苦和挫折而进行的奋斗。</p>');
INSERT INTO `announcement` VALUES (65, '2025-03-19 11:19:26', '你要去相信，没有到不了的明天', '有梦想就去努力，因为在这一辈子里面，现在不去勇敢的努力，也许就再也没有机会了。你要去相信，一定要相信，没有到不了的明天。不要被命运打败，让自己变得更强大。不管你现在是一个人走在异乡的街道上始终没有找到一丝归属感，还是你在跟朋友们一起吃饭开心址笑着的时候闪过一丝落寞。', 'upload/news_picture5.jpg', '<p>有梦想就去努力，因为在这一辈子里面，现在不去勇敢的努力，也许就再也没有机会了。你要去相信，一定要相信，没有到不了的明天。不要被命运打败，让自己变得更强大。</p><p>不管你现在是一个人走在异乡的街道上始终没有找到一丝归属感，还是你在跟朋友们一起吃饭开心址笑着的时候闪过一丝落寞。</p><p>	不管你现在是在图书馆里背着怎么也看不进去的英语单词，还是你现在迷茫地看不清未来的方向不知道要往哪走。</p><p>不管你现在是在努力着去实现梦想却没能拉近与梦想的距离，还是你已经慢慢地找不到自己的梦想了。</p><p>你都要去相信，没有到不了的明天。</p><p>	有的时候你的梦想太大，别人说你的梦想根本不可能实现;有的时候你的梦想又太小，又有人说你胸无大志;有的时候你对死党说着将来要去环游世界的梦想，却换来他的不屑一顾，于是你再也不提自己的梦想;有的时候你突然说起将来要开个小店的愿望，却发现你讲述的那个人，并没有听到你在说什么。</p><p>不过又能怎么样呢，未来始终是自己的，梦想始终是自己的，没有人会来帮你实现它。</p><p>也许很多时候我们只是需要朋友的一句鼓励，一句安慰，却也得不到。但是相信我，世界上还有很多人，只是想要和你说说话。</p><p>因为我们都一样。一样的被人说成固执，一样的在追逐他们眼里根本不在意的东西。</p><p>所以，又有什么关系呢，别人始终不是你、不能懂你的心情，你又何必多去解释呢。这个世界会来阻止你，困难也会接踵而至，其实真正关键的只有自己，有没有那个倔强。</p><p>这个世界上没有不带伤的人，真正能治愈自己的，只有自己。</p>');
INSERT INTO `announcement` VALUES (66, '2025-03-19 11:19:26', '离开是一种痛苦，是一种勇气，但同样也是一个考验，是一个新的开端', '无穷无尽是离愁，天涯海角遍寻思。当离别在即之时，当面对着相濡以沫兄弟般的朋友时，当面对着经历了四年的磨合而形成的真挚友谊之时，我内心激动无语，说一声再见，道一声珍重都很难出口。回想自己四年大学的风风雨雨，回想我们曾经共同经历的岁月流年，我感谢大家的相扶相依，感谢朋友们的莫大支持与帮助。虽然舍不得，但离别的脚步却不因我们的挚情而停滞。', 'upload/news_picture6.jpg', '<p>无穷无尽是离愁，天涯海角遍寻思。当离别在即之时，当面对着相濡以沫兄弟般的朋友时，当面对着经历了四年的磨合而形成的真挚友谊之时，我内心激动无语，说一声再见，道一声珍重都很难出口。回想自己四年大学的风风雨雨，回想我们曾经共同经历的岁月流年，我感谢大家的相扶相依，感谢朋友们的莫大支持与帮助。虽然舍不得，但离别的脚步却不因我们的挚情而停滞。离别的确是一种痛苦，但同样也是我们走入社会，走向新环境、新领域的一个开端，希望大家在以后新的工作岗位上能够确定自己的新起点，坚持不懈，向着更新、更高的目标前进，因为人生最美好的东西永远都在最前方!</p><p>忆往昔峥嵘岁月，看今朝潮起潮落，望未来任重而道远。作为新时代的我们，就应在失败时，能拼搏奋起，去谱写人生的辉煌。在成功时，亦能居安思危，不沉湎于一时的荣耀、鲜花和掌声中，时时刻刻怀着一颗积极寻找自己新的奶酪的心，处变不惊、成败不渝，始终踏着自己坚实的步伐，从零开始，不断向前迈进，这样才能在这风起云涌、变幻莫测的社会大潮中成为真正的弄潮儿!</p>');
INSERT INTO `announcement` VALUES (67, '2025-03-19 11:19:26', 'Leave未必是一种痛苦', '无穷无尽是离愁，天涯海角遍寻思。当离别在即之时，当面对着相濡以沫兄弟般的朋友时，当面对着经历了四年的磨合而形成的真挚友谊之时，我内心激动无语，说一声再见，道一声珍重都很难出口。回想自己四年大学的风风雨雨，回想我们曾经共同经历的岁月流年，我感谢大家的相扶相依，感谢朋友们的莫大支持与帮助。虽然舍不得，但离别的脚步却不因我们的挚情而停滞。', 'upload/news_picture7.jpg', '<p>无穷无尽是离愁，天涯海角遍寻思。当离别在即之时，当面对着相濡以沫兄弟般的朋友时，当面对着经历了四年的磨合而形成的真挚友谊之时，我内心激动无语，说一声再见，道一声珍重都很难出口。回想自己四年大学的风风雨雨，回想我们曾经共同经历的岁月流年，我感谢大家的相扶相依，感谢朋友们的莫大支持与帮助。虽然舍不得，但离别的脚步却不因我们的挚情而停滞。离别的确是一种痛苦，但同样也是我们走入社会，走向新环境、新领域的一个开端，希望大家在以后新的工作岗位上能够确定自己的新起点，坚持不懈，向着更新、更高的目标前进，因为人生最美好的东西永远都在最前方!</p><p>忆往昔峥嵘岁月，看今朝潮起潮落，望未来任重而道远。作为新时代的我们，就应在失败时，能拼搏奋起，去谱写人生的辉煌。在成功时，亦能居安思危，不沉湎于一时的荣耀、鲜花和掌声中，时时刻刻怀着一颗积极寻找自己新的奶酪的心，处变不惊、成败不渝，始终踏着自己坚实的步伐，从零开始，不断向前迈进，这样才能在这风起云涌、变幻莫测的社会大潮中成为真正的弄潮儿!</p>');
INSERT INTO `announcement` VALUES (68, '2025-03-19 11:19:26', '公告资讯', '回头看看，你会不会发现，曾经的你在这里摔倒过;回头看看，你是否发现，一次次地重复着，却从没爬起过。而如今，让我们把视线转向前方，那一道道金色的弧线，是流星飞逝的痕迹，或是成功运行的轨道。今天的你，是否要扬帆起航，让幸福来敲门?清晨的太阳撒向大地，神奇的宇宙赋予它神奇的色彩，大自然沐浴着春光，世界因太阳的照射而精彩，林中百鸟啾啾，河水轻轻流淌，汇成清宁的山间小调。', 'upload/news_picture8.jpg', '<p>回头看看，你会不会发现，曾经的你在这里摔倒过;回头看看，你是否发现，一次次地重复着，却从没爬起过。而如今，让我们把视线转向前方，那一道道金色的弧线，是流星飞逝的痕迹，或是成功运行的轨道。今天的你，是否要扬帆起航，让幸福来敲门?</p><p>清晨的太阳撒向大地，神奇的宇宙赋予它神奇的色彩，大自然沐浴着春光，世界因太阳的照射而精彩，林中百鸟啾啾，河水轻轻流淌，汇成清宁的山间小调。</p><p>是的，面对道途上那无情的嘲讽，面对步伐中那重复的摔跤，面对激流与硬石之间猛烈的碰撞，我们必须选择那富于阴雨，却最终见到彩虹的荆棘路。也许，经历了那暴风雨的洗礼，我们便会变得自信，幸福也随之而来。</p><p>司马迁屡遭羞辱，却依然在狱中撰写《史记》，作为一名史学家，不因王权而极度赞赏，也不因卑微而极度批判，然而他在坚持自己操守的同时，却依然要受统治阶级的阻碍，他似乎无权选择自己的本职。但是，他不顾于此，只是在面对道途的阻隔之时，他依然选择了走下去的信念。终于一部开山巨作《史记》诞生，为后人留下一份馈赠，也许在他完成毕生的杰作之时，他微微地笑了，没有什么比梦想实现更快乐的了......</p><p>或许正如“长风破浪会有时，直挂云帆济沧海”一般，欣欣然地走向看似深渊的崎岖路，而在一番耕耘之后，便会发现这里另有一番天地。也许这就是困难与快乐的交融。</p><p>也许在形形色色的社会中，我们常能看到一份坚持，一份自信，但这里却还有一类人。这类人在暴风雨来临之际，只会闪躲，从未懂得这也是一种历炼，这何尝不是一份快乐。在阴暗的角落里，总是独自在哭，带着伤愁，看不到一点希望。</p><p>我们不能堕落于此，而要像海燕那般，在苍茫的大海上，高傲地飞翔，任何事物都无法阻挡，任何事都是幸福快乐的。这里可以发布一些相关公告或者资讯内容的。。。。</p>');

-- ----------------------------
-- Table structure for author
-- ----------------------------
DROP TABLE IF EXISTS `author`;
CREATE TABLE `author`  (
  `ID` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `CREATE_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `ACCOUNT` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '账号',
  `PASSWORD` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `AUTHOR_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '作者姓名',
  `GENDER` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '性别',
  `AVATAR` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '头像',
  `AGE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '年龄',
  `ID_CARD` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '身份证',
  `PHONE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '手机',
  `EMAIL` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '邮箱',
  `AUDIT_STATUS` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '待审核' COMMENT '审核状态',
  `AUDIT_REPLY` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '审核回复',
  PRIMARY KEY (`ID`) USING BTREE,
  UNIQUE INDEX `UK_ACCOUNT`(`ACCOUNT` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 29 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '作者' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of author
-- ----------------------------
INSERT INTO `author` VALUES (21, '2025-03-19 11:19:26', '账号1', '123456', '作者姓名1', '男', 'upload/zuozhe_touxiang1.jpg', '年龄1', '440300199101010001', '13823888881', '773890001@qq.com', '是', '');
INSERT INTO `author` VALUES (22, '2025-03-19 11:19:26', '账号2', '123456', '作者姓名2', '男', 'upload/zuozhe_touxiang2.jpg', '年龄2', '440300199202020002', '13823888882', '773890002@qq.com', '是', '');
INSERT INTO `author` VALUES (23, '2025-03-19 11:19:26', '账号3', '123456', '作者姓名3', '男', 'upload/zuozhe_touxiang3.jpg', '年龄3', '440300199303030003', '13823888883', '773890003@qq.com', '是', '');
INSERT INTO `author` VALUES (24, '2025-03-19 11:19:26', '账号4', '123456', '作者姓名4', '男', 'upload/zuozhe_touxiang4.jpg', '年龄4', '440300199404040004', '13823888884', '773890004@qq.com', '是', '');
INSERT INTO `author` VALUES (25, '2025-03-19 11:19:26', '账号5', '123456', '作者姓名5', '男', 'upload/zuozhe_touxiang5.jpg', '年龄5', '440300199505050005', '13823888885', '773890005@qq.com', '是', '');
INSERT INTO `author` VALUES (26, '2025-03-19 11:19:26', '账号6', '123456', '作者姓名6', '男', 'upload/zuozhe_touxiang6.jpg', '年龄6', '440300199606060006', '13823888886', '773890006@qq.com', '是', '');
INSERT INTO `author` VALUES (27, '2025-03-19 11:19:26', '账号7', '123456', '作者姓名7', '男', 'upload/zuozhe_touxiang7.jpg', '年龄7', '440300199707070007', '13823888887', '773890007@qq.com', '是', '');
INSERT INTO `author` VALUES (28, '2025-03-19 11:19:26', '1', '1', '王慧', '女', 'upload/zuozhe_touxiang8.jpg', '35', '440300199808080008', '13823888888', '773890008@qq.com', '是', '正常');

-- ----------------------------
-- Table structure for message_board
-- ----------------------------
DROP TABLE IF EXISTS `message_board`;
CREATE TABLE `message_board`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `USER_ID` bigint NOT NULL COMMENT '留言人id',
  `USERNAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '用户名',
  `AVATAR_URL` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '头像',
  `CONTENT` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '留言内容',
  `C_PICTURE` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '留言图片',
  `REPLY` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '回复内容',
  `R_PICTURE` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '回复图片',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1681903719013 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '留言板' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of message_board
-- ----------------------------
INSERT INTO `message_board` VALUES (71, '2025-03-19 11:19:26', 1, '用户名1', 'upload/messages_avatarurl1.jpg', '留言内容1', 'upload/messages_cpicture1.jpg', '回复内容1', 'upload/messages_rpicture1.jpg');
INSERT INTO `message_board` VALUES (72, '2025-03-19 11:19:26', 2, '用户名2', 'upload/messages_avatarurl2.jpg', '留言内容2', 'upload/messages_cpicture2.jpg', '回复内容2', 'upload/messages_rpicture2.jpg');
INSERT INTO `message_board` VALUES (73, '2025-03-19 11:19:26', 3, '用户名3', 'upload/messages_avatarurl3.jpg', '留言内容3', 'upload/messages_cpicture3.jpg', '回复内容3', 'upload/messages_rpicture3.jpg');
INSERT INTO `message_board` VALUES (74, '2025-03-19 11:19:26', 4, '用户名4', 'upload/messages_avatarurl4.jpg', '留言内容4', 'upload/messages_cpicture4.jpg', '回复内容4', 'upload/messages_rpicture4.jpg');
INSERT INTO `message_board` VALUES (75, '2025-03-19 11:19:26', 5, '用户名5', 'upload/messages_avatarurl5.jpg', '留言内容5', 'upload/messages_cpicture5.jpg', '回复内容5', 'upload/messages_rpicture5.jpg');
INSERT INTO `message_board` VALUES (76, '2025-03-19 11:19:26', 6, '用户名6', 'upload/messages_avatarurl6.jpg', '留言内容6', 'upload/messages_cpicture6.jpg', '回复内容6', 'upload/messages_rpicture6.jpg');
INSERT INTO `message_board` VALUES (77, '2025-03-19 11:19:26', 7, '用户名7', 'upload/messages_avatarurl7.jpg', '留言内容7', 'upload/messages_cpicture7.jpg', '回复内容7', 'upload/messages_rpicture7.jpg');
INSERT INTO `message_board` VALUES (78, '2025-03-19 11:19:26', 8, '用户名8', 'upload/messages_avatarurl8.jpg', '留言内容8', 'upload/messages_cpicture8.jpg', '回复内容8', 'upload/messages_rpicture8.jpg');
INSERT INTO `message_board` VALUES (1681903719012, '2025-03-19 11:28:38', 1681903700270, '2', 'upload/1681903688933.jpg', '有什么问题或者意见都是可以在这里进行交流或者反馈给管理员的，管理员可以进行回复', NULL, '好的可以的', NULL);

-- ----------------------------
-- Table structure for novel_category
-- ----------------------------
DROP TABLE IF EXISTS `novel_category`;
CREATE TABLE `novel_category`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `CATEGORY_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '小说类型',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `UK_CATEGORY_NAME`(`CATEGORY_NAME` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 39 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '小说类型' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of novel_category
-- ----------------------------
INSERT INTO `novel_category` VALUES (31, '2025-03-19 11:19:26', '小说类型1');
INSERT INTO `novel_category` VALUES (32, '2025-03-19 11:19:26', '小说类型2');
INSERT INTO `novel_category` VALUES (33, '2025-03-19 11:19:26', '小说类型3');
INSERT INTO `novel_category` VALUES (34, '2025-03-19 11:19:26', '小说类型4');
INSERT INTO `novel_category` VALUES (35, '2025-03-19 11:19:26', '小说类型5');
INSERT INTO `novel_category` VALUES (36, '2025-03-19 11:19:26', '小说类型6');
INSERT INTO `novel_category` VALUES (37, '2025-03-19 11:19:26', '小说类型7');
INSERT INTO `novel_category` VALUES (38, '2025-03-19 11:19:26', '热血');

-- ----------------------------
-- Table structure for novel_chapter
-- ----------------------------
DROP TABLE IF EXISTS `novel_chapter`;
CREATE TABLE `novel_chapter`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `REF_ID` bigint NOT NULL COMMENT '关联表id',
  `CHAPTER_NUM` int NOT NULL COMMENT '章节数',
  `CHAPTER_TITLE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '章节标题',
  `CONTENT` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '章节内容',
  `VIP_READ` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '否' COMMENT '会员阅读',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1681903893099 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '小说信息章节表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of novel_chapter
-- ----------------------------
INSERT INTO `novel_chapter` VALUES (91, '2025-03-19 11:19:26', 41, 1, '第一章 离乡', '<p> 铁柱坐在村内的小路边，望着蔚蓝的天空，神情发呆，铁柱不是他的本名，而是从小因为身体瘦弱，父亲怕养不活，于是按照习俗称呼的小名。</p><p> 他的本名叫做王林，王姓在四周几个村落内算是大姓，祖上木匠出身，尤其是在县城，王氏家族也算颇有名气，拥有数个专门卖木制品的店铺。</p><p> 铁柱的父亲是家族内庶出的次子，不能接管家族要务，而是在成婚后离开县城，在此地村庄定居。</p><p> 由于有一手精湛的木匠活儿，铁柱家境也算小康，吃穿不愁，就算是在村子里，也多受人尊敬。</p><p> 铁柱从小就极为聪明，喜欢读书，想法很多，几乎是村子内公认的神童，父亲每次听到别人夸奖，脸上的皱纹都会绽开，露出开怀的微笑。</p><p> 母亲更是对他关心有佳，可以说从小到大，铁柱都是生活在父母的慈爱之中，他知道父母对他期望很高，别人家的孩子在他这个年纪都已经下地干农活了，可他却在家读书。</p><p> 书读的多了，想法自然也就随之而来，对于山村外的世界，他充满向往。抬头望了望小路的尽头，铁柱叹息一声，合上手中书本，起身向家中走去。</p><p> 父亲坐在院子里，手中拿着烟袋，深深的吸了一口后，对推门进来的铁柱说道：“铁柱，书读的怎么样了？”</p><p> 铁柱应付了几句，父亲磕了磕烟袋，起身说道：“铁柱啊，你要好好读书，明年就是县里大考了，你以后有没有出息，可就全看这次了，可别跟我一样，这辈子就呆在村子里，唉。”</p><p> “行了，你天天叨叨，要我说，我们家铁柱一定能考上。”铁柱的母亲，端着饭菜放在院内桌子上，招呼他们父子二人过来吃饭。</p><p> 铁柱哦了一声，坐下后胡乱的拔了几口，母亲慈爱的望着儿子，把不多的几块肉，给他夹过去。</p><p> “爹，四叔快来了吧？”铁柱抬头说道。</p><p> “算算时间，差不多就是这几天了，你四叔比爹有出息，唉，孩儿他娘，给老四准备的山菜都包好了吧？”父亲一提起老四，脸上露出唏嘘之色。</p><p> 母亲点头，感慨道：“铁柱啊，你四叔是个好人，这几年幸亏他帮助，你爹做的木雕才能卖出价钱，你以后要是有出息了，别忘记报答你四叔。”</p><p> 正说着，忽然门外传来马声，接着马车轱辘压地的哗哗声随之而来，一个爽朗的声音在外面响起。</p><p> “二哥，开门喽。”</p><p> 铁柱惊喜，立刻跑过去把院子大门推开，只见一个精壮的中年汉子，目光炯炯的站在门外，他看到铁柱后哈哈一笑，摸了摸他的脑袋，笑道：“铁柱，这才半年没看到，个子又长高了。”</p><p> 铁柱父母连忙站起，他父亲笑道：“老四，我约莫时间，你也快来了，快进来，铁柱，还不去给你四叔拿凳子去。”</p><p> 铁柱高兴的应了一声，急忙跑回屋子，拿出一个板凳放在饭桌旁，用袖子认真的擦了擦，希冀的望着中年汉子。</p><p> 中年汉子冲他眨了眨眼睛，打趣道：“铁柱，这次怎么这么勤快啊，我记得上次我来的时候，你可没这样啊。”</p><p> 铁柱父亲瞪了铁柱一眼，笑骂道：“这小兔崽子，刚才就在叨叨你是不是快来了。”</p><p> 中年汉子看到铁柱小脸微红，笑道：“铁柱，你四叔可没忘记答应你的东西。”说完，从怀来拿出两本线状书，放在桌子上。</p><p> 铁柱兴奋的欢呼一声，拿起书翻看一下，喜不自禁。</p><p> 铁柱他娘慈祥的望了眼自己儿子，对中年汉子说道：“老四，你哥平时总念叨你，这次多住几天吧。”</p><p> 中年汉子摇头道：“二嫂，家族这段日子事情多，我明儿一早就要赶回去，等这段时间忙完了，我再来看你们。”说完，他歉意的看了看自己二哥。</p><p> 铁柱父亲叹息，说道：“老四别听你嫂子的，明儿把货物装好，家族的事儿最重要，咱们以后再聚也一样。”</p><p> 中年汉子望着铁柱父亲，说道：“二哥，铁柱今年十五岁了吧？”</p><p> 铁柱父亲点头，感慨道：“过了年，这小兔崽子就十六了，唉，一晃十多年过去，真快。”说着，他眼露溺爱之色，望着自己的儿子。</p><p> 中年汉子沉吟少许，面色一肃，说道：“二哥，二嫂，和你们说件事儿，恒岳派今年收取弟子，家族有三个推荐名额，分到我这里有一个。”</p><p> 铁柱父亲一怔，失色道：“恒岳派？可是那个全都是仙人的恒岳派？”</p><p> 中年汉子一笑，点头说道：“二哥，就是那个仙人门派，咱们家族在附近也算望族，有推荐资格，我家小子你也知道，读书不行，舞刀弄剑倒是擅长，我琢磨着仙人不大会收我家小子，这名额珍贵，我看铁柱从小就聪明，喜好读书，说不定能行。”</p><p> 铁柱母亲喜极，急忙说道：“老四，这……这……”</p><p> 中年汉子摸了摸铁柱脑袋，说道：“二哥，二嫂，我看这事就这么定了吧，让铁柱去试试，要是真被收取了，那就是他的福分。”</p><p> 铁柱迷惑的望着父母与四叔，他有些听不懂他们说些什么，仙人？什么叫做仙人？铁柱犹豫了一下，轻声询问。</p><p> 中年汉子面色严肃，望着铁柱，说道：“铁柱啊，仙人就是可以在天上飞来飞去，他们每一个人都神通广大，不是我们凡人可以琢磨的。”</p><p> 铁柱懵懂间，对仙人有了一丝好奇。</p><p> 铁柱父亲激动起身，拉着铁柱他娘对中年汉子就要鞠躬，中年汉子连忙把他们扶起，诚恳的说道：“二哥，你这是做什么。我娘死的早，要不是二娘小时候照顾我，我也不可能有今天，铁柱是我侄儿，我这么做是应该的。”</p><p> 铁柱父亲感慨流泪，重重的拍了拍中年汉子，点了点头，随后疾言厉色的对铁柱说道：“王林你记住，以后无论如何，都不要忘记你四叔对咱们家的恩惠，否则我就没你这个儿子！”</p><p> 铁柱内心一颤，他虽然对仙人还是懵懂，但却从父母的表情中看出他们对此事极为重视，于是跪在四叔面前，重重的磕了几个响头。</p><p> 中年汉子拉起铁柱，赞赏的说道：“好孩子，你这几天收拾一下，我月底来接你！”</p><p> 旁晚，铁柱早早的睡下，耳边还能听到院子里父亲与四叔的声音，父亲今天很高兴，很少喝酒的他，说什么也要和四叔喝上几杯。</p><p> “仙人？到底是什么？”铁柱内心很兴奋，他幼小的心灵隐约知道，这将是自己的一个机会，一个可以去外面世界的机会！</p><p> 第二天一早，四叔离开了，铁柱的父母拉着他一直送到村口，在回来的路上，铁柱清晰的看到，父亲似乎一下子年轻了很多，看向他的眼神，也充满了期望。</p><p> 这种期望的眼神，要比之前让他去县里大考时，浓重很多。</p><p> 小山村内根本没有秘密可言，就是一只狗生了几个崽子也能在瞬间传遍全村，很快全村的人都从铁柱母亲嘴里知道了这个消息，纷纷来访，每个人的眼神看向铁柱时都不同，有羡慕，有嫉妒……</p><p> “王家生了个好娃，人家被恒岳派收为弟子了。”</p><p> “铁柱这孩子我从小看他长大，这孩子打小就聪明，这次又成为恒岳派弟子，以后定有大出息。”</p><p> “铁柱有本事，以后出息了可别忘记咱们村，多回来看看啊。”</p><p> 诸如此类的话，纷纷涌入铁柱耳中，渐渐的说成了他已经成为恒岳派弟子一般，父母每次听到，都笑的合不上嘴，脸上的皱纹似乎都少了很多。</p><p> 每当铁柱独自走在村内，所有看到他的村民，都热情的拉着他问来问去，更有甚者甚至当着自己孩子面，把铁柱当成榜样，训导一番。</p><p> 半个月的时间很快过去，铁柱成为恒岳派弟子的消息迅速传开，周围十里八乡的村民，都陆续的前来道贺，他们的主要目的是看一看铁柱。</p><p> 每个人来时，都会准备礼物，铁柱父母推脱不掉，也就收下了。不过在这些人离开时，他们都会为其准备一份重重的回礼，按照铁柱父亲的话说，咱家的娃儿以后那是高高在上的仙人，不能让他欠下这么多人情债，所有来访的村民，咱都给他回礼。</p><p> 此时，王氏家族的族人，也渐渐知道老四把自己娃的名额让给铁柱的事情，纷纷陆续前来道喜。</p><p> 对于自己家族的族人，铁柱父亲极为重视，这些人里有很多是之前瞧不起他的，更有多年前把他逼出家族的，现在这些人一个个前来他家，让他感觉一下子多年的憋屈一扫而空。</p><p> 他和铁柱他娘商量一下，准备好好招待一番，于是花了大价钱，请村里的教书先生写下请帖，送往族内。</p><p> 教书先生说什么也不收钱，只是要求铁柱必须要承认，他从小就在自己这里念书，对此铁柱没啥说的，这本就是事实嘛。</p><p> 请帖送到后，王氏家族族内大部分亲戚都来庆祝，由于来人太多，铁柱他爹把招待地点选在了村子中心的广场，摆下数百桌宴席。</p><p> 村子的居民自行帮着招待，相互交谈之时无不对铁柱赞叹有佳，夸奖不已。</p><p> 至于铁柱他爹，则是带着老婆孩子亲自在村口迎接，为铁柱一一介绍亲戚身份。</p><p> “这是你三祖父，当初爹离开家族，你三祖父暗中帮衬了不少，铁柱，你以后要记的报答。”铁柱父亲搀扶着一个白发苍苍的老人，对王林说道。</p><p> 铁柱连忙乖巧的应诺，老人望着铁柱，感慨道：“老二啊，时间真快，你家娃娃都这么大了，你这娃很好，比你有出息。”</p><p> 铁柱父亲满面红光，笑道：“三祖父，铁柱这孩子从小就聪明，指定是比我强啊。您老慢点走，孩儿他娘，扶着三祖父过去。”</p><p> 铁柱母亲连忙上前，搀扶老人走向宴席。</p><p> 看到老人走了后，铁柱他爹哼了一声，对铁柱说道：“这老家伙，当初看不上你爹，非要把我逼走，现在铁柱你出息了，又来道喜，这亲戚啊，就是这样。”</p><p> 铁柱懵懂的点了点头，问道：“爹，四叔今天来么？”</p><p> 铁柱父亲摇头道：“你四叔传来信儿，他在外地回不来，等月底接你时才能赶回。”</p><p> 这时，又有马车奔行而来，在村口停下后，走出一个五十多岁的老者，他望了望铁柱父亲，轻叹一声，说道：“老二，恭喜。”</p><p> 铁柱父亲面色复杂，许久后说道：“大哥……”</p><p> 老者目光一扫，望着铁柱，微笑道：“老二，这就是你家小子吧，不错，这次说不定真能被选上。”</p><p> 铁柱父亲眉头一皱，随后舒展开，说道：“铁柱这孩子没啥优点，就是打小聪明，愿意读书，这次指定是会被选上。”</p><p> “那可不一定，仙人门派收取弟子，要求非常严格，讲究有没有仙缘，我看这小子傻头傻脑的，去了也是白搭。”一个傲慢不逊的声音悠悠传来，从马车上走下一个十六七的少年。</p><p> 少年相貌俊美，剑眉星目，面如冠玉，眼中露出轻蔑之色。</p><p> 铁柱父亲怒目而视，王林则深深的看了对方一眼，没有说话。</p><p> 老者面色一肃，喝道：“王卓，怎么这么没有礼貌，这是你二叔，这是你弟弟王林，还不见礼。”说完，他又对铁柱父亲说道：“犬子说话难听，老二你别介意，不过……”说道这里，他话锋一转，又道：“不过老二，这仙人收徒，可不是那么简单的事情，需要讲究缘分，这次是恒岳派道虚上仙看重了犬子，这才对我王氏家族感兴趣，给了包括犬子在内的三个名额。”</p><p> 铁柱父亲哼了一声，说道：“你家娃既然能行，我家娃，一定也会被选中！”</p><p> 少年耻笑，根本就不在乎老者的喝斥，蔑视道：“你就是二叔吧，我劝你还是别往好了想，这修仙体制不说万中无一也差不多，这傻小子不可能和本少爷比，本少是被仙师内定的弟子，他能比么？”</p><p> 老者脸上得意之色一闪而过，又训斥了几句，对铁柱父亲一抱拳，带着少年走向宴席。</p><p> “铁柱，不要有压力，要是真没被选上也不算啥，明年去县里大考也是一样。”铁柱父亲憋了半天气，许久后才缓舒出来，语重心长的说道。</p><p> 王林目光坚定，低声道：“爹，你放心，我一定能被选中！”</p><p> 铁柱他爹温和的拍了拍儿子肩膀，眼神中露出期望的目光。</p><p> 又陆续迎接了不少亲戚，铁柱父亲最后带着他回到宴席，此时高朋满座，场面热闹非凡，众人相互庆祝，熙熙攘攘。</p><p> “族内的亲戚们，父老乡亲们，我王天水没啥文化，不会说什么词儿，但是我今天高兴，我家娃这次有机会被恒岳派选中弟子，是我这辈子最高兴的事儿，我多了也不说了，感谢各位来我这儿道喜，谢谢了！”铁柱父亲大声说完，端起酒杯一干二净。</p><p> “老二，你家娃娃从小就聪明伶俐，一定能被选中，和王卓那孩子一样，成为仙人。”</p><p> “二哥，你有铁柱这孩子，这辈子算不白活了，以后等着享福就行了。”</p><p> “铁柱，给你爹争口气，这次无论如何也要进入恒岳派。”</p><p> 场面一时间大为锦繁，庆祝声四起，不过暗地里，也有很多人抱着看热闹的心态，比如王卓的父亲，就是如此，他表面上恭喜，内心却从来都瞧不起这个二弟，对他的孩子就更是如此，他望了望自己家的小子，又看了看铁柱，内心颇不以为然，心道老四这次把名额让出，虽然出乎自己预料，但只要那些仙人不是瞎子，就不可能选中铁柱。</p><p> 人生百态，此间众人一一可见，铁柱父亲拉着铁柱，挨个桌子敬酒，为他介绍一个又一个陌生的亲戚。</p><p> 这一天，铁柱的父亲喝了很多酒，他从来没有这么风光过，一直到很晚，亲戚陆续离开。临走时，少年王卓依然还是那副瞧不起的表情，趁人不注意在铁柱耳边轻声道：“傻小子，你不会被选中的，你没有那块料。”</p><p> 说完，他轻蔑的一笑，随着他父亲离开了。</p><p> 回到家中，铁柱躺在床上，内心暗自决定，无论如何，也要被选中！</p><p> 半个月匆匆而过，这一天，铁柱四叔赶着马车来了。</p><p> 铁柱父母连忙把他迎入房内，中年汉子洗了把脸，匆匆说道：“二哥，二嫂，这次不能待时间长，我接上铁柱马上离开，明天一早恒岳派就要来接人了。”</p><p> 铁柱父亲一怔，脸上露出一丝不舍之意，果断的说道：“行，铁柱，跟着你四叔走吧，你……你若是被选中，就踏踏实实的在恒岳派，若是……若是没被选中，不要有任何负担，回到家里来。”</p><p> 铁柱不舍的望着父母，重重的点了点头，他母亲从房间拿出个包裹，爱怜的说道：“铁柱，出去要听四叔话，不要惹事，外面不比家里，遇事多忍让，娘给你准备了几件新衣服，还有你最爱吃的烤甘薯，娘会想你的，要是没被选中，就回来……”铁柱他娘说着说着，眼泪就流了下来。</p><p> 铁柱从小到大，都没有出过村子，这次，是他第一次离开。</p><p> 四叔在一旁感慨，说道：“铁柱，给你爹娘争口气，一定要被选中。二哥，二嫂，家族几天后会有大型欢庆席，今天着急，我明儿来接你们一起过去，家族的三个被推荐上去的娃娃，那时就有结果了。”</p><p> 说完，他拉着铁柱匆匆上了马车，抽了马匹一鞭子，扬长而去。</p><p> 铁柱的爹娘，一直望着飞快消失的马车，泪流不止。</p><p> “他爹，铁柱从来没离开过咱们身边，这次他出去会不会受欺负。”铁柱他娘咬着下唇，眼中露出不舍。</p><p> “娃娃长大了，自有他们的福气……”铁柱父亲拿起烟袋，深深的吸了一口，脸上的皱纹，一下子又多了不少。</p>', '否');
INSERT INTO `novel_chapter` VALUES (92, '2025-03-19 11:19:26', 41, 2, '第二章 仙人', '<p> 马车飞快的在小路上驰骋，王林的身子随着地面的坑洼起伏晃动，他抱着怀里的包裹，内心跌宕，带着父母对他的期望，离开了居住十五年的山村。</p><p> 此地距离县城有不短的路程，王林渐渐睡下，也不知过了多久，他被人轻轻推动，睁开眼睛一看，四叔面带微笑的望着他，打趣道：“铁柱，第一次离开家门，有什么感想啊。”</p><p> 王林察觉到马车已经停下，憨笑道：“没啥感想，就是有些害怕，不知道能不能被仙人收入。”</p><p> 四叔哈哈一笑，拍了拍铁柱肩膀，说道：“行了，别想那么多了，到地方了，这是四叔家，你先去休息，等早上我带去你家族。”</p><p> 下了马车后，展现在王林面前的是一片瓦房，跟着四叔来到一处房间，王林坐在床上却怎么也没有睡意，他脑中闪过一幕幕爹娘、乡亲、亲戚的言语，内心轻叹，对于被仙人收入弟子的念头，更重了。</p><p> 时间一点点过去，不大一会天色微亮，日头渐渐升起，王林尽管一夜没怎么休息，但精神却很充沛，带着一丝忐忑，他随着四叔来到了王氏家族的大宅子。</p><p> 这是王林第一次看到这么大的房子，眼花缭乱，四叔边走边叹道：“铁柱，这次一定要给你爹争口气，可别叫亲戚们笑话。”</p><p> 王林内心更加紧张，紧咬下唇，点了点头。</p><p> 不大一会儿，四叔把他领到宅子正中的大院子里，铁柱他爹的大哥，那个老者站在院中，看到铁柱后略点头，说道：“铁柱，一会仙人来了，可别大惊小怪，一切事情就跟着你哥哥王卓学，他怎么做，你就怎么做，知道么！”</p><p> 最后几个字，老者语气严厉。</p><p> 王林沉默不语，四下一看，发现除了王卓之外，还有一个少年，少年皮肤略黑，虎头虎脑，眼中更是透出一丝机灵，他衣内鼓鼓，好似揣了什么东西。</p><p> 他看到铁柱望向自己，冲他做了个鬼脸，跑过来问道：“你就是二叔家的铁柱哥吧，我叫王浩。”</p><p> 王林轻笑，点了点头。</p><p> 老者看到铁柱居然不理会自己，心底微恼，正要喝斥。</p><p> 就在这时，忽然天上云彩飘扬，一道剑光闪电般破空而来，剑光消散后，地面上站立一白衣青年，青年目光炯炯有神，散发出飘逸不凡的气质，他神态冰冷，目光在铁柱等三少年身上一扫，尤其是在机灵少年身上鼓鼓之物处看了眼，冷声道：“王家的三个名额，就是他们？”</p><p> “这就是仙人？”对方一眼之下，王林只感觉身体一凉，心脏止不住的狂跳，小脸面无血色，呆呆的望着对方。</p><p> 再看那个一脸机灵之色的少年，也是双手放在裤边，毕恭毕敬，眼中露出狂热之色。</p><p> 唯有王卓，漫不经心的看了对方一眼，鼻子里轻哼一声。</p><p> 王卓的父亲连忙上前，满脸恭敬之色，寒蝉若惊道：“上仙，这三人正是王家推荐的族人。”</p><p> 青年点头，不耐烦的说道：“谁是王卓？”</p><p> 老者面上一喜，连忙拉着王卓说道：“上仙，这就是犬子王卓。”</p><p> 青年深深的看了王卓一眼，面色微缓，点头道：“王师弟果然一表人才，难怪能被道虚师叔看中。”</p><p> 王卓得意的看了看铁柱与另外那个机灵少年，自傲的说道：“那是自然，本少的修仙灵根，道虚仙人可是夸奖不已。”</p><p> 青年眉头一皱，但很快就舒展开，似笑非笑的望了王卓一眼，袖子一卷，带着三个少年腾云驾雾化作长虹，瞬间消失在原地。</p><p> 四叔抬头望着天空，喃喃自语道：“铁柱，一定要被选中啊！”</p><p> 王林感觉身子一轻，剧烈的罡风吹的脸上生痛，仔细一看，立刻震惊的发现自己居然被夹在青年的腋下，正在空中飞快前行，地面的村庄变成一个个巴掌大的黑点，飞快的向后移动。</p><p> 就这么一小会儿，他的眼睛就已经被风吹的通红，眼泪哗哗流下。</p><p> “你们三个不想眼睛瞎掉，就闭眼。”青年冰冷的声音传来。王林内心一颤，连忙闭上双眼，不敢再看，内心对于修仙，更加的向往了。</p><p> 时间不长，王林能感觉到青年略有气喘，速度也明显降了下来，接着眼前一花，青年迅速落下，在落地的一刻，青年松开手臂，三个少年摔落在地。</p><p> 好在摔落的力道不重，三人连忙爬起，展现在王林面前的，是一处宛如世外桃源般的仙境，青山绿水，鸟语花香。</p><p> 正前方，一座高耸入云的山峰，千岩竞秀，云雾缭绕，看不清细貌，时而传来一两声兽鸣。一条扭曲的石阶小径，自山峰蜿蜒而下，宛若画中景色，山明水秀。一种隔世之感悠然而生。</p><p> 远远向上看去，山峰顶端有座大殿，虽说被云雾遮掩，但阵阵七彩光芒闪烁，让人一看不由升起膜拜之意。</p><p> 大殿旁，一座横生而出的长条石桥仿若弯月般，延伸至虚空云雾之中，与另一座山峰相连。</p><p> 如此洞天福地，自然就是恒岳派的山门所在，恒岳派是赵国为数不多的修真门派之一，500年前曾一度统领整个赵国修真界，拥有数位元婴期老怪，风光无限，可惜随着时间的流逝，中间历经数场变故，时至今日，昔日的苍天大派，已经萎缩到只能勉强在修真界站稳脚跟的地步。</p><p> 不过尽管如此，恒岳派对于四周万里之内的凡人来说，依然还是可望而不可及。</p><p> “张师弟，这三个可是王家推荐的少年？”一个身穿黑衣的中年人，带着一丝仙风道骨之气，从山峰下飘然而至。</p><p> 青年脸上露出恭敬之色，说道：“三师兄，这三人正是王家推荐。”</p><p> 中年人目光一扫，在王卓的身上重点看了几眼，含笑道：“掌门知道你修炼到了关键处，让我来进行这次测试，你去修炼吧。”</p><p> 青年应诺，身体一动，顺着山峰小径，眨眼间就消失无影。</p><p> 王林呆呆的望着眼前的一幕，心潮澎湃，忽感有人拉自己衣服，扭头一看，正是那一脸机灵之色少年，少年眼中狂热之色更浓，低声道：“这就是仙人居住的地方，他奶奶的，我王浩说什么也在被选中！”说完，他摸了摸自己衣内鼓鼓之物。</p>', '否');
INSERT INTO `novel_chapter` VALUES (93, '2025-03-19 11:19:26', 41, 3, '第三章 测试', '<p> 王卓对于眼前的景象，也是怔在当场，许久后才缓过神，内心傲气不知觉的收敛了很多。</p><p> 此时，又有几道长虹剑光临至，每道剑光消散后，都会现出恒岳派弟子，在他们的身边，毫无例外跟着几个十五六岁的少年。</p><p> 这些人有男有女，在落下的一刻均都是如王林三人般，呆呆的望着眼前的景物，脸上表情不一。</p><p> 带众人来此的恒岳派弟子零散的站在不远处，相互交谈打量这些少年。又等了一会，最终所有被推荐到此地的少年都来齐，此时黑衣中年人扫了一眼众人，声音不含任何感情，说道：“你们之中，只有极少的几个会被选中成为我恒岳派弟子。”</p><p> 众少年寒蝉若惊，王林更是内心忐忑，他数了下，测试的一共48人。</p><p> “修仙，首重天资，接下来第一项测试，就是看你们灵根是否充足。现在我点到谁，谁就到我近前来。”中年人面无表情，随意的点了一个少年。</p><p> 少年双腿微颤，小心翼翼的走了过去，中年人手按在少年头顶，淡然道：“不合格，到左面站好。”</p><p> 少年似乎一下子失去了所有的力气，神情黯淡，眼带茫然的走到左边，沉默不语。</p><p> 接着又一个少年被点中，忐忑不安的上前。</p><p> “不合格。”</p><p> “不合格。”</p><p> “不合格。”</p><p> 连续十多个人，均都不合格，中年人的右边，到现在为止一个人都没有。</p><p> 王卓被点中，他脸上傲气尽收，面色有些苍白，走上前。</p><p> 中年人手放在王卓头上后，忽然面露喜色，语气温和，说道：“你叫什么名字？”</p><p> 王卓连忙恭敬道：“回禀上仙，小子王卓。”</p><p> 中年人点头，笑道：“原来你就是道虚师叔提到过的王卓，恩，到右边站好。”</p><p> 王卓大喜，在所有人的羡慕目光中，走到右边，眼中傲气又现，轻蔑的望着众人，神情不可一世。</p><p> “妈的，他是走狗屎运了。”王浩撇了撇嘴，对王林低声道。</p><p> 王林内心更加紧张，他眼前浮现父母期待的目光，握紧了拳头。</p><p> “不错，你也去右边站好。”中年人惊喜的声音传来，在他面前是一个少女。</p><p> 时间过去不长，大部分少年都被测试完，可站在中年人右边的，只有两人。接下来，王浩被点中。</p><p> 王浩一路小跑，站在中年人面前，还没等对方测试，立刻跪在地上重重的磕了几个响头，大声道：“上仙仙福永享，寿与天齐，小子王浩，您测试这么多人，一定很辛苦，要不您休息一会？我不着急，没事。”</p><p> 中年人哑然失笑，测试了这么多人，均都是一脸紧张，惟独眼前这个少年虎头虎脑，最为机灵，居然还拍起了马屁。按在王浩头上，他摇头说道：“资质差些，不……”</p><p> 王浩一听说自己资质不行，内心立刻跌至低谷，还没等对方说完，立刻从怀里拿出一个玉盒，双手交上，机灵的说道：“上仙，这是家父偶然间在山中得到，尝试多次都打不开，小子特地从家里带来，献给上仙您。”</p><p> 中年人轻笑摇头，正要拒绝，但一扫玉盒，忽然瞳孔一阵收缩，抓起仔细一看，顿时面露喜色，说道：“不错，居然是一株有300年的灵芝，看这玉盒样子，应是被修真者封印在内，难怪你父亲打不开。”他语气一顿，略微沉吟，含笑道：“我身边缺个炼丹的小童，我看你比较机灵，可愿意做我小童？”</p><p> 王浩立即惊喜起来，跌宕起伏的差异，让他激动不已，大声说道：“愿意，上仙，我愿意。”</p><p> 中年人含笑点头，说道：“做我药童，也不会亏待你，可与其他弟子一样修炼门内仙术，你站在右边吧。”</p><p> 王浩内心兴奋，跑到右边，得意洋洋的瞪了王卓一眼。</p><p> 所有的失败者，均都面露惺惺之色，一个个催头丧气，更有甚者，已经泪流满面，哭泣不已。</p><p> 中年人眉头一皱，喝道：“哭泣者，直接送走！”</p><p> 站在不远处的恒岳派弟子，立即走出几人，抓起几个啼哭者，漫不经心的踏着剑光迅速消失。</p><p> 中年人随手一指，点中王林。</p><p> 王林深吸口气，紧张万分的走到中年人身边，他脑中一片空白，心里默默祈祷，眼前禁不住回想起父母期望的目光。</p><p> “我一定能被选中！”王林坚定的想到。</p><p> 对方手一按，面无表情吐出三个让王林如坠冰窟的字。</p><p> “不合格！”</p><p> 王林不知道自己是怎么走到左面队伍中，他只感觉耳边仿佛春雷般轰轰作响，回荡起伏间，尽是缭绕那三个字。</p><p> 不大一会，所有人都被测试完，站在右边的，只有三个人，这三个人，在失败者眼中，犹如天之骄子一般，高大无比。</p><p> 王卓更是轻蔑的望着王林，目中讥讽之意表露无疑。</p><p> “修仙，资质虽然重要，但毅力更为关键，你们这些资质平凡的少年，若是具备毅力，倒也可以成为记名弟子！这第二项测试，就是毅力！”中年人面无表情，顿了一下，又道：“顺着此处阶梯上去，达到顶端者，算合格，若第三天仍未完成，就是失败，失败者会被送回你们各自的家族。如果半途坚持不住或者遇到危险，就大声呼喊放弃，自会有人把你们带走。”</p><p> 说完，中年人含笑望着右边的三人，说道：“你们随我去见掌门，到时候会安排师父，王浩，你就不要去了，随我去丹房，熟悉一下操作。”</p><p> 中年人吩咐完，便带着三个天之骄子踏上山峰，消失匿迹。</p><p> 王林深吸口气，目光坚定，毫不犹豫踏步向石阶走去，进行第二项测试，毅力。</p><p> 除去三个天之骄子以及六个因哭泣被送走的少年外，还剩下39人。</p><p> 这39人中有催头丧气者，也有神情坚毅者，更有犹豫害怕者，彼此前后不一，渐渐踏上阶梯，走出各自不同的未来。</p>', '否');
INSERT INTO `novel_chapter` VALUES (94, '2025-03-19 11:19:26', 41, 4, '第四章 无情', '<p> 石阶陡峭不平，两旁更是险境连连，稍有不慎就会失足掉落。</p><p> 走了不到半天，王林就感觉双腿如灌铅，挥汗如雨，上气不接下气般难以迈步，当初在山脚下看，这条石阶小径不长，可实际走在上面，却发现这小径好似没有尽头般，让人从心底不由产生绝望的思绪。</p><p> 在他的前面有十几个身体强壮的少年，也均都气喘吁吁，缓缓上爬。到现在为止，还没有一个放弃的。</p><p> 王林咬牙坚持，他知道这是自己最后一次机会，父母期望的眼神一直徘徊心中，就在这时，在他身后一个少年忽然脚下一颤，踩空，身体从一旁迅速落下，惊恐的尖叫顿时彻响。</p><p> “我放弃，救命！”</p><p> 所有人都停下脚步，不约而同的向下望去，只见一道乌光闪烁，一个恒岳派弟子不知从什么地方冲出，抓住身处半空的少年，身子轻轻的落在山脚下。</p><p> 王林面色苍白，沉默不语，小心翼翼的继续向上爬去，时间匆匆而过，两天后，他前面的十几个少年，已经看不到身影。</p><p> 王林不知道这些同伴到底有多少放弃的，他只知道，自己绝对不能放弃，尽管双腿双脚已经摸出血泡，钻心的刺痛时刻从破碎的血泡中传来，但他仍然坚持用手攀爬前行。</p><p> “稚子心坚，奈何大道无情，徒劳，徒劳罢了……”一声悠悠的叹息，远远的从山峰顶端飘落而下，一个面色蜡黄的中年人，身子轻飘飘的从石阶落下，在一个个少年身边飞快走过，面带感慨之色。</p><p> 在路过王林身边时，中年人略顿一下，眼前此子是他看到的第六个少年，但绝对是最狼狈的一个，全身鲜血淋淋，衣服已经被血液浸透，膝盖，脚指血肉模糊，完全是用着双手在一点点攀爬，中年人轻叹一声，问道：“孩子，你叫什么名字？”</p><p> 王林神情已经模糊，他心里只有一个念头，那就是死也要爬到山顶，对于中年人的问话，他根本就没听到，在他的眼里，除了这条石阶小径之外，别无他物。</p><p> 中年人注视王林双眼，对他的心念之坚颇为动容，手在王林头上一按，随后摇头自语道：“毅力绝佳，可惜资质太过普通，无缘，无缘啊……”他深深的看了眼王林，继续向石阶下走去。</p><p> 第二天夜晚，王林双手血肉模糊，他爬过的石阶，留下一道深深的血迹，对于这些，王林已经不知道了，他现在全凭一股意念在催动身体，气息已至弥留之际。</p><p> 在第三天日出的一刻，他模糊间似看到了石阶的尽头，可惜此时一个无情的声音如雷鸣般传来，震入心间。</p><p> “时间已到，只有三人合格，其余……失败！”</p><p> 王林惨笑一声，身子一歪，倒在石阶上，昏迷不醒。</p><p> 三天前测试天资的黑衣中年人，站在山顶，望着距离此处不到十丈的王林，眼露无情之色。</p><p> 这时几个恒岳派弟子迅速从山顶向下走去，一路上把所有还在坚持的少年带到山上，统一喂食药物。</p><p> “师兄，39个测试者，放弃25人，除了合格的三人外，还有11人。”一个恒岳派女弟子，冷声回报，她当年就经历过这样残酷的测试，最终靠着自小练习武术的底子，在毅力上勉强合格，才成为记名弟子，用了近十年的时间努力，到现在仍然未成为真正的弟子。</p><p> 黑衣中年人神态冰冷，略点头，目光一扫均都昏迷的11个少年，淡淡的开口道：“合格的三人，带他们去见杂务处，安排日后的工作。放弃的25人，送回各自家族。至于这坚持到最后的11人，待他们苏醒后，统一送到剑灵阁，看看有没有人与剑灵有缘，若是没有，依然还是送回各自家族。”</p><p> 说完，中年人看都不看这些少年一眼，拂袖而走。</p><p> 三天后，剑灵阁内，包括王林在内的11个少年，均都面色苍白的站在一旁，王林身上的伤势已经痊愈，但心灵的伤口却撕裂更大，阵阵钻心的痛，止不住的吞噬他的身心。</p><p> 这剑灵测试，并非黑衣中年人主持，而是一个身穿白衣的陌生青年，不过毫无例外的，都是面色冰冷，望向他们的眼光，犹如看蝼蚁般，无情。</p><p> “这是最后测试，能走进这房间者，合格。”青年言辞简短，脸上更是露出不耐烦之色。</p><p> 王林目光所及，是一处普通至极的房舍，房舍正中大门打开，向里望去，只见一把把长短不一的古剑，摆放在内。</p><p> 少年们一个个按照顺序，向房间走去，第一个少年刚刚走近房屋五丈处，就面露挣扎之色，被一股无形的力道推动退出几丈。</p><p> “不合格，下一个！”青年淡淡的说道。</p><p> 王林是第七个，之前的六人全部都是在五丈处无法前进，他苦涩一笑，提起心底剩余不多的期望，向前走去。</p><p> 五丈处，轻松踏过，王林一呆，内心期望迅速攀升，口干舌燥，心脏狂跳，又继续踏出一丈，此时仍未感觉任何不适。</p><p> 青年“咦”的一声，目光闪动，露出一丝感兴趣的神色，面容微缓，说道：“别犹豫，继续向里走，若是能走进房屋，获得剑灵认同，哪怕你之前两次测试都不合格，也会被收为真正的弟子！”</p><p> 其他十个少年，均都面露羡慕之色，这种羡慕之中，还藏有深深的嫉妒。</p><p> 王林内心紧张，父母期待的目光再次用入脑海，又踏出一丈，此时距离大门，还有三丈。王林忐忑，再次踏出一步。</p><p> 就在此时，一股庞大的力道忽然出现，疯狂的涌向王林，他身体不受控制的飞快退后，一直到十多丈处，才停了下来。</p><p> 站在一旁的其余少年，均都眼露嘲讽之色，在他们看来，王林就应该和自己一样，不可能有任何机会。</p><p> 惨笑一声，王林内心撕裂的伤口更大了，父母期待的目光渐渐从脑海中消散掉。</p><p> 青年神情又如之前般冰冷，淡淡说道：“不合格，下一个。”</p>', '否');
INSERT INTO `novel_chapter` VALUES (95, '2025-03-19 11:19:26', 41, 5, '第五章 回程', '<p>十一个人，最终没有一个合格，除了王林外，还有一个少女也同样踏入到两丈处，但结果依然。</p><p>当天测试完，众少年就被遣散到山下，被恒岳派弟子一一送走，送王林回家族的，还是带他们来此地的那个张姓青年，在他的身边，跟着王卓与王浩。</p><p>“王卓师弟，恭喜你成为道虚师叔的弟子，以后前途不可限量。”青年含笑，抱拳道。</p><p>王卓脸上露出不可一世的表情，傲然道：“那是自然，师父已经说了，只待我这次回家处理完俗事，便传我修仙法术。”</p><p>王浩在一旁撇嘴，说道：“我从小就看不上你那副小人得志的表情，不就是有师父么，算什么大不了的，小爷还会炼丹呢。”</p><p>王卓轻蔑的看了眼王浩，没理会他，而是目光转动，望着一旁沉默不语的王林，轻笑道：“铁柱，怎么样，之前我就和你说了，你没那块料，你和你爹都不信，现在知道结果了吧。”</p><p>王林抬头，淡淡的看了眼王卓，对恒岳派青年说道：“上仙，我父母都在等我，还请您快些把我送回去吧。”</p><p>王卓看见王林居然不理会自己，再次冷笑道：“土包子，这辈子就待在村子里像你爹一样当木匠吧。”</p><p>青年脸中露出似笑非笑的表情，看了看眼前的三个少年，也没说话，袖子一卷，带着三人消失在恒岳派山门。</p><p>回去的路上，罡风依旧，可王林的心绪，却是天地之别，来时期望，回时绝望。</p><p>时间不长，王氏家族大宅子目光可及，王林睁开双眼，远远望去只见大宅子内人头怂恿，热闹似锦，一桌桌档次远远超过他爹前几日招待亲戚的宴席，把整个大院子都铺满。</p><p>王氏家族所有人，甚至连那些在外地采购木料的族人也都回来，齐聚一堂相互庆祝，觥筹交错，熙来攘往。</p><p>这次宴席的主角是三个人，王天水的大哥，王天水，以及他的三弟，在这三个人身边，所有的亲戚都相互上前庆祝，场面热闹非凡。</p><p>他们眼中毫无例外都是露出羡慕之色，口中更是阿谀奉承，尽挑好词，尤其是对王林的父亲，更是磋叹不已，唏嘘往事。</p><p>“二哥，这次你家小子一定会被选中，以后你就不用干木匠活了，家里谁看见你不得叫一声二爷啊。”王林父亲的六弟，一个大腹便便的中年人，大声赞道。</p><p>“老二，当年我就看出你这辈子绝对不一般，怎么样，让我看对了吧，你这辈子应在铁柱身上了，铁柱成为仙人，你这当爹的，那可就了不得了。”王天水的五叔，眯个小眼睛，坐在王林父亲身边，举杯阿谀说道。</p><p>“二哥，你家铁柱和我家小子，这次都能被选中，咱哥俩有十几年没见了，这次说什么也要不醉不归。”王浩的父亲，王天水的三弟，端着酒杯来到面前，一脸的笑意，大声说道。</p><p>铁柱父亲望着四周这些之前瞧不起他的亲戚们，颇感扬眉吐气，风光无限，多年的阴郁一扫而空，不过却始终有一块大石压在心头。</p><p>“铁柱啊，一定要被选中！”</p><p>“二嫂，你跟着我二哥这辈子算是享福了，有了铁柱这孩子，以后咱们十里八村的，谁不认识你啊。”</p><p>“就是，二嫂，你家娃娃可比我家小子有本事，铁柱这孩子从小就明聪，真是个好孩子啊。”</p><p>“铁柱娘，咱们虽说是同族，但现今同族通婚的多了去，我家闺女也到了年纪，铁柱这孩子仪表堂堂，我从小就喜欢，不如咱们两家结个亲家？”与铁柱父亲一样，铁柱母亲身边也围绕着一群女眷，相互热情的唠着乡间家常。</p><p>铁柱的大哥，冷眼望着这一切，内心暗道等着吧，等仙人把孩子送回来，就知道结果了，到时候若是铁柱没被选中，看老二你如何收场。</p><p>想到这里，他面上哈哈一笑，端起酒杯与身边夸奖他家孩子的亲戚，应承了几句。</p><p>场面沸沸扬扬，繁闹不已。就在这时，忽然一道长虹从天际划过，落在大院子中，露出四人。</p><p>四周瞬间安静下来，所有的王氏族人都兢兢战战，不敢说话。</p><p>恒岳派青年目光一扫，暗自感叹，他当日被恒岳派收为弟子时，家乡人也是这样庆祝，一时之间颇为感慨，回头深深的看了眼王林，他知道这少年接下来要面对的事情，是成年人都无法承受的。</p><p>“大道无情……”青年摇头，身体一动，架起剑光离开此地。</p><p>“修道者不能有俗世牵挂，你们各自处理好，三天后，我再来接你们。”远远的，传来他的声音。</p><p>铁柱父亲的大哥，一看到仙人离开，立即走出激动的望着自己儿子，问道：“道虚上仙可收你为徒？”</p><p>王卓一脸自得之色，傲道：“那是自然，师父说我十年内，将会成为恒岳派弟子中的翘楚。”</p><p>王卓父亲大喜，重重的拍了拍儿子的肩膀，开怀道：“好！王卓你以后就是仙人了，咱们王家，有仙人了，哈哈。”</p><p>王浩的父亲，此时也是一脸焦急之色，盯着王浩，正要询问，王浩打了个哈欠，得意道：“爹，不用问了，你儿子已经是恒岳派弟子了。”</p><p>王浩父亲狂喜，拿起酒杯狠狠的喝了一口，王卓目露轻蔑之色，阴阳怪调的说道：“三叔，你生了个好儿子，把我们王家的脸都丢光了，当着所有人面大拍仙人马屁，最后又送礼，这才勉强获得一个药童的资格。”</p><p>王浩眉毛一挑，讥讽道：“我乐意，怎么的，到时候看看谁的仙法厉害就知道谁给王家丢脸了。”</p><p>铁柱的父亲，一直望着自家娃，他从铁柱脸上看到一丝没落，内心一颤，升起一股不妙的预感。</p><p>“铁柱，你……你怎么样？”铁柱他娘，满怀期望的问道。</p>', '否');
INSERT INTO `novel_chapter` VALUES (96, '2025-03-19 11:19:26', 41, 6, '第六章 势利', '<p> 铁柱沉默，王卓在一旁讥讽道：“这小子我早就说了，没那块料，现在可好，白白去丢人显眼，我是第一次测试就被收取了，没看到他后面几次测试，不过听说是三项测试没一个合格的，早听我的，都不如不去，我约莫四叔家的虎子去都比他强。”</p><p> 铁柱的四叔，眉头一皱，喝道：“王卓，即便你成为仙人，也别在我面前放肆。我家虎子有没有那块料，该你屁事，没大没小的。”</p><p> 王卓目中寒光一闪，冷笑几句没有说话。</p><p> 铁柱的父亲，一下子似乎苍老了十多岁，瘫坐在椅子上。铁柱母亲，也是怔住了，似乎不敢相信，问道：“铁柱……是……是真的么？”</p><p> 铁柱紧咬下唇，浑不在意鲜血留下，噗通一声跪在地上，重重的磕了几个头，低声说道：“爹，娘，铁柱没被仙人收入，对不起你们……我……我来生再报你们养育之恩。”</p><p> 铁柱他娘察觉到自己孩子语气的绝望，立刻跑过去，把铁柱抱起，呜咽道：“娃儿，没事，不用难过，不就是没被仙人收入么，等明年咱们去县里大考，也是一样，娃儿，你可千万别做傻事，想开点，你爹和娘以后还指望你送终呢。”</p><p> 铁柱他爹此时也恢复过来，看着铁柱的神情，内心一震，连忙过去抱着铁柱，焦急的说道：“铁柱，你可别做傻事，一切有爹呢，听爹的话，咱回家好好读书，明年大考也是一样。”</p><p> 四周的亲戚，一个个嘴脸变的极快，纷纷远离铁柱爹娘，脸上均露出看热闹的神态，闲言碎语，议论纷纷。</p><p> “铁柱这孩子，我之前就觉得不行，他怎么能和大哥家的王卓比啊，这次算是丢人丢到家了。”铁柱父亲的六弟，嘲讽道。</p><p> “就是，早知道是这样，就别弄的好像真的被收入似的，多丢人啊，老二，你都这么大年纪的人了，怎么尽办些蠢事，难怪当初你爹没把家产分给你。”铁柱父亲的三叔，面露厌恶之色，讥讽道。</p><p> “要我说，这孩子从小聪明这事，十有八九是假的，估计是老二觉得自己这辈子没啥出息，所以把自己娃娃一顿吹嘘，现在可好，被揭穿了吧。”刚才坐在铁柱父亲身边的五叔，嘴脸立刻变换，一改刚才阿谀之色。</p><p> “三个娃娃去测试，就他一人儿失败，铁柱这孩子，是咱们王家最差的一个了，丢人啊，二嫂子啊，刚才我还说你和二哥在一起享福，现在一看，你这辈子也就这样了，没那个福气。”女眷中有人嘲讽道。</p><p> “可不是么，前几天我还去他们村里看到铁柱了，当时我就寻思着这孩子傻啦吧唧的，怎么能和王卓和王浩那两个娃娃比，准成不了。”铁柱的五叔嫂，也换上嘴脸，讥讽起来。</p><p> “我早就看出铁柱这娃娃不行，你们看看他爹他娘，就那样还能生出个什么好娃子呢，咱们王家，也就大哥和老三家的孩子有出息，铁柱，呸，就这名字看起来就傻里傻气的。”女眷中另一人，也不甘落后嘲讽道。</p><p> “我刚才是瞎了眼了，还要把自己闺女往火坑里推，幸好这铁柱没被仙人收入，不然我闺女以后还不得恨我一辈子啊，铁柱他娘，亲家这事，咱就这么算了，你家娃娃既然当不成仙人，谁会把闺女许给他啊，这不是癞蛤蟆想吃天鹅肉么。”</p><p> 一时之间，几乎所有的亲戚都一个个露出势利的嘴脸，各种恶毒的话语越来越严重，无情的打击着铁柱一家人。</p><p> 这一幕，与刚才的奉承相比，天地之差。更有甚者，干脆撕破脸皮直接开口就索要之前赠送的礼品，听的铁柱爹娘面无血色，王林握紧了拳头，内心的伤痛，更加剧烈，他仿佛有一种要死了的感觉，耳边传来的尽是嘲讽的话语。</p><p> 王卓的父亲，内心冷笑，漫不经心的说道：“老二，之前我就说了，仙人收徒讲究缘分，要求很严格的，除非像我儿子这样优秀，否则根本就没有半点机会，你可倒好，还真当回事了，现在弄得孩子都绝望的活不下去了，何必呢？”</p><p> 铁柱的父亲忍无可忍，猛的回头，怒目而视，喝道：“王天山，你给我住口，当年爹临终前明明把家产留给我一份，你费尽苦心联系亲戚抢走我那份，今天还在这里冷嘲热讽，你真当我王天水没血性么！</p><p> 还有你们这些亲戚，刚才阿谀奉承，现在冷嘲热讽，我家娃都这样了，你们还在那里落井下石，难道就没有一点人性么！”</p><p> 王天山语气一滞，怒声道：“以前的事提那么多干什么，你家娃娃本就不是那块料，我好心劝你，你非但不感谢，反而冲我发火，哼，上梁不正下梁歪，爹这怂样，儿子也好不到哪去！”</p><p> 周围传来的不屑嘲笑以及讥讽，落在呆呆站在原地的王林耳中，恍如一根根利刺狠狠的扎在心脏一般，他强忍内心撕裂的剧痛，冷眼看这一切，记住了每一个亲戚的嘴脸。</p><p> “你！！我和你拼了！”铁柱他爹抄起一旁板凳，就要冲上去，铁柱四叔连忙冲出，拦住后低声道：“二哥，你别冲动，老大家中仆人很多，别吃亏了，有我呢，你看我的。”</p><p> 说完，他瞪着王天山，说道：“大哥，有你这么说话的么，我老四听不下去了，你要是再敢在我面前辱我二哥，别怪我不讲兄弟情分，王家虽大，但老四我这几年结识的江湖朋友也不少，可别被一把火烧个干净！”</p><p> 王天山诺诺了几句，内心对这个交友广泛的四弟很是忌惮。</p><p> “老四，你这话就不对了，老二家的娃娃，本就不是那块料，我们说说难道还错了？这娃不行，还不允许我们长辈说说，这可太没道理了。”辈分最老的三祖叔，不满的说道。</p>', '是');
INSERT INTO `novel_chapter` VALUES (97, '2025-03-19 11:19:26', 7, 7, '章节标题7', '章节内容7', '是');
INSERT INTO `novel_chapter` VALUES (98, '2025-03-19 11:19:26', 8, 8, '章节标题8', '章节内容8', '是');
INSERT INTO `novel_chapter` VALUES (1681903893098, '2025-03-19 11:31:32', 41, 7, '2112121212', '<p>12212212212</p>', '是');

-- ----------------------------
-- Table structure for novel_comment
-- ----------------------------
DROP TABLE IF EXISTS `novel_comment`;
CREATE TABLE `novel_comment`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `REF_ID` bigint NOT NULL COMMENT '关联表id',
  `USER_ID` bigint NOT NULL COMMENT '用户id',
  `AVATAR_URL` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '头像',
  `NICKNAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '用户名',
  `CONTENT` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '评论内容',
  `REPLY` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '回复内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1681903994248 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '小说信息评论表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of novel_comment
-- ----------------------------
INSERT INTO `novel_comment` VALUES (1681903994247, '2025-03-19 11:33:14', 41, 1681903700270, 'upload/1681903688933.jpg', '2', '好友意思啊。。。', '感谢支持。。。');

-- ----------------------------
-- Table structure for novel_info
-- ----------------------------
DROP TABLE IF EXISTS `novel_info`;
CREATE TABLE `novel_info`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `NOVEL_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '小说名称',
  `CATEGORY_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '小说类型',
  `PICTURE` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '图片',
  `DESCRIPTION` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '小说简介',
  `ACCOUNT` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '账号',
  `AUTHOR_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '作者姓名',
  `PUBLISH_TIME` datetime NULL DEFAULT NULL COMMENT '发布时间',
  `CLICK_TIME` datetime NULL DEFAULT NULL COMMENT '最近点击时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 49 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '小说信息' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of novel_info
-- ----------------------------
INSERT INTO `novel_info` VALUES (41, '2025-03-19 11:19:26', '鬼吹灯', '热血', 'upload/xiaoshuoxinxi_tupian1.jpg,upload/xiaoshuoxinxi_tupian3.jpg', '小说简介1测试', '1', '作者姓名1', '2025-03-19 19:19:26', '2025-02-24 13:26:13');
INSERT INTO `novel_info` VALUES (42, '2025-03-19 11:19:26', '小说名称2', '小说类型2', 'upload/xiaoshuoxinxi_tupian2.jpg,upload/xiaoshuoxinxi_tupian3.jpg,upload/xiaoshuoxinxi_tupian4.jpg', '小说简介2', '账号2', '作者姓名2', '2025-03-19 19:19:26', '2025-03-19 19:19:26');
INSERT INTO `novel_info` VALUES (43, '2025-03-19 11:19:26', '小说名称3', '小说类型3', 'upload/xiaoshuoxinxi_tupian3.jpg,upload/xiaoshuoxinxi_tupian4.jpg,upload/xiaoshuoxinxi_tupian5.jpg', '小说简介3', '账号3', '作者姓名3', '2025-03-19 19:19:26', '2025-03-19 19:19:26');
INSERT INTO `novel_info` VALUES (44, '2025-03-19 11:19:26', '小说名称4', '小说类型4', 'upload/xiaoshuoxinxi_tupian4.jpg,upload/xiaoshuoxinxi_tupian5.jpg,upload/xiaoshuoxinxi_tupian6.jpg', '小说简介4', '账号4', '作者姓名4', '2025-03-19 19:19:26', '2025-03-19 19:19:26');
INSERT INTO `novel_info` VALUES (45, '2025-03-19 11:19:26', '小说名称5', '小说类型5', 'upload/xiaoshuoxinxi_tupian5.jpg,upload/xiaoshuoxinxi_tupian6.jpg,upload/xiaoshuoxinxi_tupian7.jpg', '小说简介5', '账号5', '作者姓名5', '2025-03-19 19:19:26', '2025-03-19 19:19:26');
INSERT INTO `novel_info` VALUES (46, '2025-03-19 11:19:26', '小说名称6', '小说类型6', 'upload/xiaoshuoxinxi_tupian6.jpg,upload/xiaoshuoxinxi_tupian7.jpg,upload/xiaoshuoxinxi_tupian8.jpg', '小说简介6', '账号6', '作者姓名6', '2025-03-19 19:19:26', '2025-03-19 19:31:56');
INSERT INTO `novel_info` VALUES (47, '2025-03-19 11:19:26', '小说名称7', '小说类型7', 'upload/xiaoshuoxinxi_tupian7.jpg,upload/xiaoshuoxinxi_tupian8.jpg,upload/xiaoshuoxinxi_tupian9.jpg', '小说简介7', '账号7', '作者姓名7', '2025-03-19 19:19:26', '2025-03-19 19:31:50');
INSERT INTO `novel_info` VALUES (48, '2025-03-19 11:19:26', '小说名称8', '小说类型8', 'upload/xiaoshuoxinxi_tupian8.jpg,upload/xiaoshuoxinxi_tupian9.jpg,upload/xiaoshuoxinxi_tupian10.jpg', '小说简介8', '账号8', '作者姓名8', '2025-03-19 19:19:26', '2025-03-19 19:19:26');

-- ----------------------------
-- Table structure for reader
-- ----------------------------
DROP TABLE IF EXISTS `reader`;
CREATE TABLE `reader`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `USERNAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户名',
  `PASSWORD` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `NICKNAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '昵称',
  `REAL_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '姓名',
  `GENDER` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '性别',
  `AVATAR` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NULL COMMENT '头像',
  `EMAIL` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '邮箱',
  `PHONE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '手机',
  `VIP` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '否' COMMENT '是否会员',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `UK_USERNAME`(`USERNAME` ASC) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1681903700271 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '用户' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of reader
-- ----------------------------
INSERT INTO `reader` VALUES (11, '2025-03-19 11:19:26', '用户名1', '123456', '昵称1', '姓名1', '男', 'upload/yonghu_touxiang1.jpg', '773890001@qq.com', '13823888881', '否');
INSERT INTO `reader` VALUES (12, '2025-03-19 11:19:26', '用户名2', '123456', '昵称2', '姓名2', '男', 'upload/yonghu_touxiang2.jpg', '773890002@qq.com', '13823888882', '否');
INSERT INTO `reader` VALUES (13, '2025-03-19 11:19:26', '用户名3', '123456', '昵称3', '姓名3', '男', 'upload/yonghu_touxiang3.jpg', '773890003@qq.com', '13823888883', '否');
INSERT INTO `reader` VALUES (14, '2025-03-19 11:19:26', '用户名4', '123456', '昵称4', '姓名4', '男', 'upload/yonghu_touxiang4.jpg', '773890004@qq.com', '13823888884', '否');
INSERT INTO `reader` VALUES (15, '2025-03-19 11:19:26', '用户名5', '123456', '昵称5', '姓名5', '男', 'upload/yonghu_touxiang5.jpg', '773890005@qq.com', '13823888885', '否');
INSERT INTO `reader` VALUES (16, '2025-03-19 11:19:26', '用户名6', '123456', '昵称6', '姓名6', '男', 'upload/yonghu_touxiang6.jpg', '773890006@qq.com', '13823888886', '否');
INSERT INTO `reader` VALUES (18, '2025-03-19 11:19:26', '1', '1', '昵称8', '姓名8', '男', 'upload/yonghu_touxiang8.jpg', '773890008@qq.com', '13823888888', '否');
INSERT INTO `reader` VALUES (1681903700270, '2025-03-19 11:28:20', '2', '1', '小白', '王丽', '女', 'upload/1681903688933.jpg', '12121@12.com', '15214121411', '是');

-- ----------------------------
-- Table structure for system_config
-- ----------------------------
DROP TABLE IF EXISTS `system_config`;
CREATE TABLE `system_config`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '配置参数名称',
  `VALUE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '配置参数值',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '配置文件' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of system_config
-- ----------------------------
INSERT INTO `system_config` VALUES (1, 'picture1', 'upload/picture1.jpg');
INSERT INTO `system_config` VALUES (2, 'picture2', 'upload/picture2.jpg');
INSERT INTO `system_config` VALUES (3, 'picture3', 'upload/1681903813498.jpg');

-- ----------------------------
-- Table structure for user_collection
-- ----------------------------
DROP TABLE IF EXISTS `user_collection`;
CREATE TABLE `user_collection`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `USER_ID` bigint NOT NULL COMMENT '用户id',
  `REF_ID` bigint NULL DEFAULT NULL COMMENT '商品id',
  `TABLE_NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '表名',
  `NAME` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '名称',
  `PICTURE` longtext CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '图片',
  `TYPE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT '1' COMMENT '类型(1:收藏,21:赞,22:踩,31:竞拍参与,41:关注)',
  `INTEL_TYPE` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '推荐类型',
  `REMARK` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1681903941675 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = '收藏表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_collection
-- ----------------------------
INSERT INTO `user_collection` VALUES (1681903912008, '2025-03-19 11:31:51', 1681903700270, 47, 'xiaoshuoxinxi', '小说名称7', 'upload/xiaoshuoxinxi_tupian7.jpg', '1', '小说类型7', NULL);
INSERT INTO `user_collection` VALUES (1681903917798, '2025-03-19 11:31:56', 1681903700270, 46, 'xiaoshuoxinxi', '小说名称6', 'upload/xiaoshuoxinxi_tupian6.jpg', '1', '小说类型6', NULL);
INSERT INTO `user_collection` VALUES (1681903941674, '2025-03-19 11:32:20', 1681903700270, 41, 'xiaoshuoxinxi', '鬼吹灯', 'upload/xiaoshuoxinxi_tupian1.jpg', '1', '热血', NULL);

-- ----------------------------
-- Table structure for user_token
-- ----------------------------
DROP TABLE IF EXISTS `user_token`;
CREATE TABLE `user_token`  (
  `id` bigint NOT NULL AUTO_INCREMENT COMMENT '主键',
  `USER_ID` bigint NOT NULL COMMENT '用户id',
  `USERNAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户名',
  `TABLE_NAME` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '表名',
  `ROLE` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '角色',
  `TOKEN` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `ADD_TIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '新增时间',
  `EXPIRATEDTIME` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '过期时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 6 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = 'token表' ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of user_token
-- ----------------------------
INSERT INTO `user_token` VALUES (1, 1, 'admin', 'users', '管理员', '314zb21fabeeh13ixwz8bhzz3u266c6v', '2025-03-19 11:26:18', '2025-02-24 14:26:52');
INSERT INTO `user_token` VALUES (2, 28, '1', 'zuozhe', '作者', '6vo5igbcycujicfanprzbt65fd9ggrcy', '2025-03-19 11:26:31', '2025-03-19 12:33:18');
INSERT INTO `user_token` VALUES (3, 18, '1', 'yonghu', '用户', 'xpywydtcaqi54tj8m6548cp9vscemc6c', '2025-03-19 11:27:19', '2025-03-19 12:27:19');
INSERT INTO `user_token` VALUES (4, 1681903700270, '2', 'yonghu', '用户', 'imy4ct63zhnk86814jjd2uiwmp01zhj9', '2025-03-19 11:28:23', '2025-03-19 12:31:48');
INSERT INTO `user_token` VALUES (5, 11, '用户名1', 'yonghu', '用户', 'j5e3f4llvr5odrlbvd339mbse51k1xvc', '2025-02-24 13:26:02', '2025-02-24 14:26:03');

SET FOREIGN_KEY_CHECKS = 1;
